In [4]:
import pandas as pd

# Create a DataFrame with specified columns and index
df = pd.DataFrame({
    "a": [4, 5, 6], 
    "b": [7, 8, 9], 
    "c": [10, 11, 12]
}, index=[1, 2, 3])

df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

# pd.melt(df): Gather columns into rows

In [5]:
df_melted=pd.melt(df)
df_melted

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

# df.pivot(columns='var', values='val'): Spread rows into columns

In [6]:
df_pivot=df_melted.pivot(columns='variable', values='value')
df_pivot

variable    a    b     c
0         4.0  NaN   NaN
1         5.0  NaN   NaN
2         6.0  NaN   NaN
3         NaN  7.0   NaN
4         NaN  8.0   NaN
5         NaN  9.0   NaN
6         NaN  NaN  10.0
7         NaN  NaN  11.0
8         NaN  NaN  12.0

# Appending DataFrames

In [10]:
#Appaned Rows
df2=pd.DataFrame({
    "a":[7,8],
    "b":[10,11],
    "c":[13,14]
})
df_appended=pd.concat([df,df2])
df_appended

   a   b   c
1  4   7  10
2  5   8  11
3  6   9  12
0  7  10  13
1  8  11  14

In [12]:
# Append Columns
df_extra_col = pd.DataFrame({
    "d":[20,21,22]
}, index=[1,2,3])
df_combined=pd.concat([df,df_extra_col], axis=1)
df_combined

   a  b   c   d
1  4  7  10  20
2  5  8  11  21
3  6  9  12  22

In [13]:
df.sort_values('a')

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [22]:
df=df.rename(columns={"a":"alpha"})
df

   alpha  b   c
1      4  7  10
2      5  8  11
3      6  9  12

In [23]:
df.sort_index()

   alpha  b   c
1      4  7  10
2      5  8  11
3      6  9  12

In [28]:
# reseting index
df.reset_index(inplace=True)

   level_0  index  alpha  b   c
0        0      1      4  7  10
1        1      2      5  8  11
2        2      3      6  9  12

In [30]:
df

   index  alpha  b   c
0      1      4  7  10
1      2      5  8  11
2      3      6  9  12

In [34]:
df.drop(columns=['index'], inplace=True)

In [35]:
df

   alpha  b   c
0      4  7  10
1      5  8  11
2      6  9  12

In [39]:
r=df.query('b>7')
r

   alpha  b   c
1      5  8  11
2      6  9  12

In [41]:
# Count distinct values
df['b'].nunique()

3

In [42]:
df['sum_cb'] = df['c'] + df['b']

In [43]:
df

   alpha  b   c  sum_cb
0      4  7  10      17
1      5  8  11      19
2      6  9  12      21

In [44]:
df = df.assign(product_ac=lambda x: x['b'] * x['c'])
print(df)

   alpha  b   c  sum_cb  product_ac
0      4  7  10      17          70
1      5  8  11      19          88
2      6  9  12      21         108

In [45]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'val1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'val2': [4, 5, 6]})
df_merged = pd.merge(df1, df2, on='key', how='inner')
print(df_merged)

  key  val1  val2
0   B     2     4
1   C     3     5

In [46]:
df_left = pd.merge(df1, df2, on='key', how='left')
print(df_left)

  key  val1  val2
0   A     1   NaN
1   B     2   4.0
2   C     3   5.0

In [47]:
df_right = pd.merge(df1, df2, on='key', how='right')
print(df_right)

  key  val1  val2
0   B   2.0     4
1   C   3.0     5
2   D   NaN     6

In [48]:
df_outer = pd.merge(df1, df2, on='key', how='outer')
print(df_outer)

  key  val1  val2
0   A   1.0   NaN
1   B   2.0   4.0
2   C   3.0   5.0
3   D   NaN   6.0

In [52]:
# Grouping and Aggregation
# Group by

df_grouped = df.groupby('b').sum()
print(df_grouped)

   alpha   c  sum_cb  product_ac
b
7      4  10      17          70
8      5  11      19          88
9      6  12      21         108

In [54]:
# Aggregate function
df_agg = df.groupby('alpha').agg({'b': 'sum', 'c': 'mean'})
print(df_agg)

       b     c
alpha
4      7  10.0
5      8  11.0
6      9  12.0

In [57]:
# Rolling mean
df_rolling = df['alpha'].rolling(window=2).mean()
df_rolling

0    NaN
1    4.5
2    5.5
Name: alpha, dtype: float64